# арифметические операторы

# print(2+2)
# print(2-2)
# print(2*2)
# print(2/2)
# print(22)
# print('меня зовут гена и ауцацуа й3 кацуац4 й3ка й3й3 вй3цац3 й3 ц4а ц аыумыкы уацукпмук уаыуа 3цац4уыа цапц4п ц3ац')
# print(3**3)
# print(2**8) # возведение в степепь
# print(9//2) # деление без остатка
# print(9%2) # вычисляет остаток от деления
# print(4+3-2*(4/2))


# Типы данных
# int - integer - целое число - 23, 2354234
# float - число с остатком - 3.2 -4545.34
# str - string - строки 'slova', "slova 2", """slova 3"""
# print("""меня зовут Гена, 
# мне 16""")
# bool - boolean - True=1, False=0
# print("16.3"-True)

# часто встречаемые ошибки:
# SyntaxError - код не правильно написан и где то вы опечатолись
# ValueError - когда что то не подходит по значению 
# TypeError - когда встречаются два или более разных типов данных

# ЯП - язые программирования
# python - динамическая типизация, где он понимает какого типа данных тот или иной объект“
# они делятся на:
# строго типизированные - когда ты к каждой переменной указываешь его тип 
# слабо типизированные - ты можешь поставить значение, а язык сам за тебя поймет какого он типа

# Переменные 
name = input("как вас зовут? ")
age = input("сколько вам лет? ")
height = input("какой ваш рост? ")
print('меня зовут', name, 'мне', age, 'мой рост', height) 
print(f'меня зовут {name} мне {age} мой рост {height}')
# f"" - format string - форматирование строки


# - Нельзя начинать название переменной с цифры
# 5number = 5  - неправильно  
# 5 = 5 - неправильно
# number_5 = 5  - правильно

# В названиях переменных разрешаются только буквы латинского алфавита, цифры и нижний пробел _  
# first_name = "Mark" - правильно  